# ComponentRepeaterSlot Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ComponentRepeaterSlot Class
Members See Also
---
Represents a slot that holds one repeated component in a component repeater.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ComponentRepeaterSlot : Element
```

Visual Basic
---
```text
Public Class ComponentRepeaterSlot _
	Inherits Element
```

Visual C++
---
```text
public ref class ComponentRepeaterSlot : public Element
```

# Remarks
Each slot can be in one of the following states:
  * Empty.
  * Occupied by an instance of the default family of the repeater that contains the slot.
  * Occupied by an instance of another family.

Initially, every occupied slot holds an instance of the default family of the repeater, based on the original element that was repeated.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ComponentRepeaterSlot
# See Also
ComponentRepeaterSlot Members
Autodesk.Revit.DB Namespace